
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Остатки Приход
	Движения.Остатки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Партия = ТекСтрокаТовары.Партия;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
		Для каждого ТекСтрокаТовара из Товары Цикл
			Если ТекСтрокаТовара.Партия = Справочники.Партия.ПустаяСсылка() Тогда
				ТекСтрокаТовара.Партия = СоздатьНовуюПартию(ТекСтрокаТовара.Товар);
			КонецЕсли;
			 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция СоздатьНовуюПартию(СписокТоваров)
	НоваяПартия = Справочники.Партия.СоздатьЭлемент();
	НоваяПартия.УстановитьНовыйКод();
	НоваяПартия.Владелец = СписокТоваров;
	НоваяПартия.ДатаПартии = ЭтотОбъект.Дата;
	НоваяПартия.Наименование = строка(ЭтотОбъект);
	НоваяПартия.Записать();
	
	Возврат НоваяПартия.Ссылка;   
КонецФункции
	
	