
&НаСервере
Процедура ТоварыТоварПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Цена=УстановкаЦены(Элементы.Товары.ТекущиеДанные.Товар,Элементы.Товары.ТекущиеДанные.Партия);
	ТоварыТоварПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Строка=Элементы.Товары.ТекущиеДанные;  
	Строка.Сумма=Строка.Цена * Строка.Количество;
КонецПроцедуры


Функция УстановкаЦены(СписокТоваров, Партия) 
	РазностьДат = (ТекущаяДата() - Партия.ДатаПартии) / 86400;
	Если РазностьДат > СписокТоваров.СрокГодности Тогда
		Возврат 0;
	КонецЕсли;                                   
	
	Годность = Перечисления.СостояниеТовара.ОграниченноГоден;
	
	Если РазностьДат < СписокТоваров.СрокГодности / 2 Тогда
		Годность = Перечисления.СостояниеТовара.ПолностьюГоден;         
	КонецЕсли;                                   
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныТоваров.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныТоваров.СрезПоследних(, Товар = &СписокТоваров И Годность = &Годность) КАК ЦеныТоваров";

	Запрос.УстановитьПараметр("СписокТоваров", СписокТоваров);
	Запрос.УстановитьПараметр("Годность", Годность);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	Цена = ВыборкаДетальныеЗаписи.Цена;
	Иначе
	Цена = 0;
КонецЕсли;  
Возврат Цена
КонецФункции;
